{
  "name": "SON (SHAWN) CONG DO",
  "title": "Senior DevSecOps Engineer",
  "phone": "+84 969 669 531",
  "perfil": "Senior DevSecOps Engineer with 7+ years of experience, specializing in designing and implementing secure, compliant cloud solutions for the financial industry. Expert in cloud technology selection (AWS, Azure, GCP), risk management, and security compliance. Proven ability to deploy robust cloud infrastructure, conduct continuous threat assessments, and ensure adherence to regulatory policies. Passionate about building resilient systems that mitigate risk and align with business goals.",
  "portfolios": [{
      "type": "Credly",
      "name": "Credly Badge",
      "link": "https://www.credly.com/users/shawndo/badges",
      "icon": "bi bi-c-circle-fill"
    },
    {
      "type": "LinkedIn",
      "name": "shawndo",
      "link": "https://www.linkedin.com/in/shawndo",
      "icon": "bi bi-linkedin"
    },
    {
      "type": "Github",
      "name": "shawnsavour",
      "link": "https://github.com/shawnsavour",
      "icon": "bi bi-github"
    },
    {
      "type": "Website",
      "name": "ShawnSavour.github.io",
      "link": "https://shawnsavour.github.io/?resume=devsecops",
      "icon": "bi bi-globe"
    }
  ],
  "email": "sondc.workspace@gmail.com",
  "linkedin": "https://www.linkedin.com/in/shawndo",
  "github": "https://github.com/shawnsavour",
  "workExperience": [
    {
      "id": 0,
      "company": true,
      "position": "Senior DevOps Engineer",
      "employer": "VMO Group - An Alten company",
      "date": "Aug 2022 - Present · 3 yrs 2 mos",
      "type": "Work",
      "description": [
        "VMO Group delivers cutting-edge software development and IT services to Fortune 500 clients across diverse industries, driving digital transformation at scale.",
        "<b>Strategic Recognition:</b> Awarded Employee of the Year for two consecutive years, acknowledging exceptional technical leadership and transformative contributions to organizational success."
      ],
      "children": [2, 1, 5, 6, 7]
    },
    {
      "id": 1,
      "position": "Senior DevOps Engineer",
      "employer": "VMO Group - An Alten company",
      "date": "Aug 2022 - Present · 3 yrs 2 mos",
      "type": "Work",
      "description": [
        "Led enterprise DevSecOps transformation, focusing on building secure and compliant Continuous Delivery Pipelines (CDP) and DevSecOps Factories for multiple delivery units.",
        "<b>Key Achievements:</b>",
        "• Designed end-to-end CDPs, reducing deployment time by 70% and improving delivery accuracy to 95%.",
        "• Implemented a comprehensive DevSecOps factory with integrated threat modeling and continuous security monitoring.",
        "• Managed Infrastructure as Code (IaC) using Terraform and GitOps, achieving 99.9% uptime.",
        "• Integrated SAST/DAST tools and automated security compliance frameworks."
      ]
    },
    {
      "id": 2,
      "parent": 1,
      "position": "Platform Leader",
      "employer": "Zuellig Pharma",
      "date": "Oct 2023 - Present · 2 yrs",
      "type": "Work",
      "description": [
        "Led platform engineering for a major healthcare provider, focusing on cloud migration and infrastructure modernization across 16 markets. My role centered on designing secure, scalable, and compliant cloud solutions.",
        "<b>Key Achievements:</b>",
        "• Led the technical design of secure cloud infrastructure using Infrastructure as Code (IaC).",
        "• Designed and deployed hybrid cloud networks for multi-region deployments.",
        "• Managed CI/CD pipelines with GitOps for automated infrastructure and application deployment.",
        "• Implemented a cloud-native microservices architecture on Kubernetes (GKE) with a strong focus on security and compliance."
      ]
    },
    {
      "id": 3,
      "position": "Senior DevSecOps Engineer",
      "employer": "BICBank Cambodia",
      "date": "Jan 2023 - Jul 2024 · 1 yr 2 mos",
      "type": "Freelance",
      "description": [
        "Led a DevSecOps transformation for a leading financial institution, focusing on designing and implementing secure, compliant, and risk-assessed cloud solutions. My role involved analyzing business needs and selecting appropriate cloud technologies to meet strict financial regulations.",
        "<b>Key Achievements:</b>",
        "• Designed and deployed enterprise-grade, cloud-native solutions on AWS, ensuring compliance with security laws and policies.",
        "• Identified and minimized operational risks through continuous security assessments.",
        "• Worked with partners to ensure the safe and secure deployment of cloud solutions.",
        "• Ensured compliance with all regulatory requirements and service quality commitments."
      ]
    },
    {
      "id": 4,
      "position": "Senior DevOps Engineer",
      "employer": "BB Digital",
      "date": "Feb 2023 - May 2024 · 1 yr 4 mos",
      "type": "Freelance",
      "description": [
        "Designed and implemented a comprehensive DevSecOps Factory with an automated Continuous Delivery Pipeline. My focus was on integrating security throughout the development lifecycle.",
        "<b>Key Achievements:</b>",
        "• Built a DevSecOps factory with automated security scanning, threat modeling, and continuous monitoring.",
        "• Implemented automated application security with SAST/DAST tools, payload encryption, and SSL pinning.",
        "• Built a comprehensive IaC framework using Terraform for consistent and secure infrastructure deployment.",
        "• Implemented a comprehensive monitoring stack for security event correlation and incident response."
      ]
    },
    {
      "id": 5,
      "parent": 1,
      "position": "Senior DevSecOps Engineer",
      "employer": "Onqlave",
      "date": "Jun 2023 - Sep 2023 · 4 mos",
      "type": "Work",
      "description": [
        "DevSecOps engineer at OQL (Australia), securing the company's Encryption-as-a-Service platform on GCP using a fully secured landing zone with Google Cloud Foundation Fabric.",
        "My responsibilities include:",
        "• Implementing and managing DevSecOps best practices throughout the software development lifecycle, from code development to deployment and operations.",
        "• Using Google Cloud Platform security tools and services to protect the company's infrastructure, data, and applications.",
        "• Configuring and managing Google Cloud Foundation Fabric to create a secure landing zone for the Encryption as a Service platform.",
        "• Working with other engineers to automate security tasks and integrate security into the company's development and operations processes.",
        "• Monitoring the performance and security of the Encryption as a Service platform and responding to incidents promptly.",
        "I am a highly skilled and experienced DevSecOps engineer with a deep understanding of Google Cloud Platform security tools and services. I am also passionate about DevSecOps and am committed to delivering secure and reliable software."
      ]
    },
    {
      "id": 6,
      "parent": 1,
      "position": "Senior DevSecOps Engineer",
      "employer": "Dentity",
      "date": "Dec 2022 - Sep 2023 · 10 mos",
      "type": "Work",
      "description": [
        "Built comprehensive DevSecOps Factory and Continuous Delivery Pipeline solutions for high-performance identity service platforms serving millions of authentication requests.",
        "<b>DevSecOps Factory & Continuous Delivery:</b>",
        "• <b>Continuous Delivery Pipeline (CDP):</b> Built automated end-to-end delivery pipelines to AWS EKS using GitLab CI and ArgoCD, achieving 99.95% deployment reliability with optimized process time and lead time metrics",
        "• <b>DevSecOps Factory Implementation:</b> Established comprehensive DevSecOps factory with integrated threat modeling, application security automation, and continuous security monitoring across the entire SDLC",
        "• <b>Security Automation Integration:</b> Implemented automated security scanning with SAST/DAST tools (Snyk, SonarQube, Trivy, OWASP ZAP), payload encryption, and SSL pinning achieving 100% vulnerability remediation SLA",
        "• <b>Continuous Integration (CI):</b> Designed CI workflows with intelligent auto-scaling using KEDA and Karpenter, enabling seamless feature integration from Program Backlog to staging validation",
        "• <b>Continuous Deployment (CD):</b> Implemented zero-downtime deployment strategies with automated rollback capabilities and intelligent traffic routing for production releases",
        "• <b>Penetration Testing Automation:</b> Integrated automated penetration testing frameworks within the continuous delivery pipeline, ensuring continuous security validation and threat detection",
        "• <b>Observability & Monitoring:</b> Built enterprise monitoring using Prometheus, Grafana, Loki, and AWS X-Ray providing real-time insights and security monitoring across distributed systems",
        "• <b>Secret Management & Compliance:</b> Automated secret management using HashiCorp Vault with OPA GateKeeper policy enforcement, ensuring zero-exposure security model and regulatory compliance"
      ]
    },
    {
      "id": 7,
      "parent": 1,
      "position": "DevOps Engineer",
      "employer": "GEM - Global Enterprise Mobility",
      "date": "Sep 2022 - Dec 2022 · 4 mos",
      "type": "Work",
      "description": [
        "Designed and implemented comprehensive logging, tracing, and monitoring infrastructure automation on AWS.",
        "Infrastructure & Automation:",
        "• Built AWS infrastructure automation using CloudFormation for scalable logging and observability systems",
        "• Implemented container-based log collection and processing pipeline using Fluent Bit and Loki",
        "• Designed distributed tracing architecture with OpenTelemetry and AWS X-Ray for application performance monitoring",
        "• Created Infrastructure as Code using HashiCorp Packer for automated AMI creation and configuration management",
        "• Established monitoring and visualization platform using Grafana for real-time infrastructure and application insights",
        "• Automated infrastructure provisioning and management for high-availability, scalable logging system"
      ]
    },
    {
      "id": 8,
      "company": true,
      "position": "DevOps Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "May 2021 - Jul 2022 · 1 yr 3 mos",
      "type": "Work",
      "description": [
        "Saltlux stands as South Korea's premier AI and big data innovation leader, delivering cutting-edge artificial intelligence solutions and large-scale data processing services that transform industries and drive digital innovation.",
        "<b>Strategic Recognition:</b> Awarded Employee of the Year for exceptional technical transformative contributions to AI infrastructure development."
      ],
      "children": [9, 13]
    },
    {
      "id": 9,
      "position": "DevOps Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "Aug 2021 - Jul 2022 · 1 yr",
      "type": "Work",
      "description": [
        "Led DevOps infrastructure and container orchestration for large-scale AI data processing systems handling petabytes of information daily.",
        "<b>Container & Infrastructure Management:</b>",
        "• <b>Large-Scale Orchestration:</b> Built and managed Google Kubernetes Engine (GKE) clusters with 800+ nodes, delivering high-throughput container orchestration for AI workloads processing 50TB+ daily",
        "• <b>Microservices Architecture:</b> Implemented microservices architecture with Docker containerization, enabling scalable data processing applications with 99.99% availability",
        "• <b>Real-Time Data Infrastructure:</b> Built real-time data streaming infrastructure using Apache Kafka, processing 100M+ events daily with sub-second latency",
        "• <b>High-Performance Caching:</b> Designed in-memory caching layers using Redis clusters, delivering sub-millisecond data access and retrieval for AI applications",
        "• <b>Observability Platform:</b> Set up enterprise monitoring and observability using Loki, Promtail, and Grafana, providing real-time insights into infrastructure and application health across distributed systems",
        "• <b>Resource Optimization:</b> Implemented AI-driven automated scaling and resource optimization for cloud-native containerized workloads, reducing infrastructure costs by 45%",
        "• <b>DevOps Framework:</b> Applied DevOps best practices for security, automation, and optimization of cloud infrastructure, achieving industry-leading operational efficiency"
      ]
    },
    {
      "id": 13,
      "position": "Principal Software Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "May 2021 - Jul 2022 · 1 yr 3 mos",
      "type": "Work",
      "description": [
        "Led full-stack software development across multiple programming languages and technology platforms, building AI-powered data mining and processing systems serving millions of users.",
        "<b>Multi-Language Development & Architecture:</b>",
        "• <b>Java Backend Development:</b> Built and developed highly scalable data extraction and processing microservices with containerized deployment, real-time search systems with intelligent auto-scaling, and high-performance RESTful APIs with database integration",
        "• <b>C# Desktop Applications:</b> Built Personal Agent Desktop applications for comprehensive data collection management and engineered Windows services for automated personalized data mining with scheduling and resource optimization",
        "• <b>JavaScript Frontend Development:</b> Developed responsive Personal Agent web frontend for intuitive data management interfaces and created Chromium extensions for seamless account-based authentication and intelligent paywall bypassing",
        "• <b>Python Automation Tools:</b> Created enterprise Social Accounts Manager for automated cookie and API token extraction, intelligent account creation automation, and comprehensive business process automation frameworks",
        "• <b>Microservices Architecture:</b> Implemented microservices architecture utilizing MongoDB for unstructured data management and PostgreSQL for structured analytics, handling 10TB+ daily data processing",
        "• <b>Software Engineering Practices:</b> Applied industry-standard software engineering methodologies including code versioning, comprehensive testing frameworks, and continuous integration practices across all technology stacks"
      ]
    },
    {
      "id": 14,
      "company": true,
      "position": "METI Government of JAPAN, Internship Program",
      "employer": "GRAVITY Corporation",
      "date": "Dec 2020 - Feb 2021 · 3 mos",
      "type": "Work",
      "description": [
        "This internship was approved by the METI Japan Internship program, organized by METI Government of Japan",
        "• Acquired knowledge about Blockchain, Web 3.0, Smart contract through internal training conferences",
        "• Learned deeply about Scrum and Agile software development methods.",
        "• Worked under the supervision of CTO",
        "• Contributed to the company's first product in the education sector"
      ]
    },
    {
      "id": 15,
      "company": true,
      "position": "PHP Web Developer",
      "employer": "WeSports",
      "date": "Apr 2019 - Jun 2020 · 1 yr 3 mos",
      "type": "Work",
      "description": [
        "•  Worked with Wordpress to create and maintain dynamic websites and web applications",
        "•  Deployed Wordpress on Apache servers and used jQuery for front-end interactivity",
        "•  Developed software solutions using PHP frameworks, SQL databases, and object-oriented programming",
        "•  Used Git for version control and collaboration"
      ]
    }
  ],
  "skills": [{
      "category": "cloud-platforms",
      "name": "Cloud Platforms",
      "items": ["AWS", "Azure", "GCP"],
      "extraclass": "li25"
    },
    {
      "category": "iac-tools",
      "name": "Platforms & IaC Tools",
      "items": ["Terraform", "CloudFormation", "Ansible", "Terragrunt", "Backstage"],
      "extraclass": "li50"
    },
    {
      "category": "programming",
      "name": "Programming Languages",
      "items": ["Python", "Golang", "Java", "NodeJS", "C#", "Bash"],
      "extraclass": "li25"
    },
    {
      "category": "container-tools",
      "name": "Containerization & Orchestration",
      "items": ["Docker", "Kubernetes", "Helm", "KEDA", "Karpenter", "Istio", "EKS", "GKE"],
      "extraclass": "li33"
    },
    {
      "category": "cicd-tools",
      "name": "CI/CD & GitOps",
      "items": ["GitLab CI", "ArgoCD", "Jenkins", "GitHub Actions", "GitOps", "Azure Pipeline"],
      "extraclass": "li33"
    },
    {
      "category": "devsecops",
      "name": "DevSecOps & Security",
      "items": ["HashiCorp Vault", "OPA GateKeeper", "SonarQube", "Trivy", "OWASP ZAP", "SAST/DAST", "SCA", "Snyk"],
      "extraclass": "li33"
    },
    {
      "category": "monitoring",
      "name": "Monitoring & Observability",
      "items": ["Prometheus-Thanos", "Grafana", "Loki", "Jaeger", "CloudWatch", "X-Ray", "ELK Stack"],
      "extraclass": "li50"
    },
    {
      "category": "database",
      "name": "Databases & Storage",
      "items": ["RDS", "Aurora", "MongoDB", "Redis", "DynamoDB", "Kafka", "S3", "GCS", "Minio", "Ceph"],
      "extraclass": "li50"
    }
  ],
  "certifications": {
    "title": "Certifications",
    "description": "Click to see more certifications",
    "link": "https://www.linkedin.com/in/shawndo/details/certifications/",
    "items": [{
        "name": "IBM DevOps and Software Engineering Specialization",
        "image": "common/img/IBM-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/specialization/certificate/GZLCQK9NM36N"
      },
      {
        "name": "DevOps on AWS Specialization",
        "image": "common/img/Udemy-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/specialization/certificate/ZDRLWB4QQ7XH"
      },
      {
        "name": "Core Infrastructure",
        "image": "common/img/Google-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/certificate/VEBM4EY9H969"
      },
      {
        "name": "Continuous Integration and Continuous Delivery (CI/CD)",
        "image": "common/img/IBM-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/certificate/R7WJJKU5U4GD"
      },
      {
        "name": "Python for Data Science and AI",
        "image": "common/img/IBM-icon.jpg",
        "link": "https://www.credly.com/badges/59286e28-5fd4-40d4-877a-797385dc4014/linked_in_profile"
      },
      {
        "name": "Python For Data Analysis, Data Science & ML With Pandas",
        "image": "common/img/Udemy-icon.jpg",
        "link": "https://ude.my/UC-6dbad681-7f62-4160-b2f0-b3890cf63984/"
      },
      {
        "name": "APTIS - C level (CERF) - 7.5 Ietls equivalent",
        "image": "common/img/BC-icon.jpg",
        "link": "#"
      }
    ]
  },
  "education": [{
      "degree": "International Business Economics",
      "school": "Foreign trade university",
      "date": "Aug 2017 - Mar 2021"
    }
  ]
}