{
  "name": "SON (SHAWN) CONG DO",
  "title": "Full Stack DevOps Engineer",
  "phone": "+84 969 669 531",
  "perfil": "Full Stack DevOps Engineer with 6+ years of experience designing and implementing secure CI/CD pipelines, infrastructure automation frameworks, and cloud-native microservices architectures. Expert in containerization technologies (Docker, Kubernetes) and Infrastructure as Code tools (Terraform, CloudFormation, Ansible). </br>Proven track record managing both cloud (AWS/Azure) and on-premise infrastructure with focus on compliance, security, and high availability. Experienced in rapid prototyping and proof-of-concept development to validate technical solutions. </br>Strong background in software development with proficiency in Python, Bash, Golang, and DevSecOps best practices. Demonstrated technical leadership experience mentoring junior team members and collaborating with cross-functional teams to solve complex infrastructure challenges.",
  "portfolios": [{
      "type": "Credly",
      "name": "Credly Badge",
      "link": "https://www.credly.com/users/shawndo/badges",
      "icon": "bi bi-c-circle-fill"
    },
    {
      "type": "LinkedIn",
      "name": "shawndo",
      "link": "https://www.linkedin.com/in/shawndo",
      "icon": "bi bi-linkedin"
    },
    {
      "type": "Github",
      "name": "shawnsavour",
      "link": "https://github.com/shawnsavour",
      "icon": "bi bi-github"
    },
    {
      "type": "Website",
      "name": "ShawnSavour.site",
      "link": "https://shawnsavour.site",
      "icon": "bi bi-globe"
    }
  ],
  "email": "sondc.workspace@gmail.com",
  "linkedin": "https://www.linkedin.com/in/shawndo",
  "github": "https://github.com/shawnsavour",
  "workExperience": [
    {
      "id": 0,
      "company": true,
      "position": "Senior DevOps Engineer",
      "employer": "VMO Group - An Alten company",
      "date": "Aug 2022 - Present · 3 yrs",
      "type": "Work",
      "description": [
        "VMO Group is an outsourcing company that provides software development and IT services to clients across various industries.",
        "Awarded Employee of the Year for two consecutive years, recognizing outstanding performance and contributions to the company."
      ],
      "children": [2, 1, 5, 6, 7]
    },
    {
      "id": 1,
      "position": "Senior DevOps Engineer",
      "employer": "VMO Group - An Alten company",
      "date": "Aug 2022 - Present · 3 yrs",
      "type": "Work",
      "description": [
        "As a Senior DevOps Engineer at VMO Group, I design and implement secure CI/CD pipelines and infrastructure automation frameworks for multiple delivery units across the organization.",
        "• Designed and maintained secure CI/CD pipelines using GitLab CI with integrated security scanning and automated deployment workflows",
        "• Implemented Infrastructure as Code (IaC) using Terraform and GitOps methodology to manage infrastructure across development, staging, and production environments",
        "• Set up and maintained robust on-premise Kubernetes clusters for containerized application deployment and management",
        "• Built infrastructure automation frameworks with Proxmox virtualization platform and Ceph distributed storage system",
        "• Integrated GitLab dynamic runner system with declarative configuration management for scalable build and deployment processes",
        "• Established monitoring and observability solutions to ensure compliance, security, and high availability of infrastructure",
        "• Mentored junior team members on DevOps best practices and cloud-native development methodologies"
      ]
    },
    {
      "id": 2,
      "parent": 1,
      "position": "Platform Leader",
      "employer": "Zuellig Pharma",
      "date": "Oct 2023 - Present · 1 yr 10 mos",
      "type": "Work",
      "description": [
        "Lead platform engineering and infrastructure automation for enterprise-scale healthcare infrastructure migration and modernization.",
        "Technical Leadership:",
        "• Lead technical design and implementation of secure, scalable cloud infrastructure using Infrastructure as Code (Terraform, CloudFormation)",
        "• Architect and implement hybrid cloud network environments with Hub and Spoke model for multi-region deployment",
        "• Design and manage CI/CD pipelines with GitOps methodology for automated infrastructure provisioning and application deployment",
        "• Implement cloud-native microservices architecture using Kubernetes (GKE) with security best practices and compliance frameworks",
        "• Establish infrastructure automation frameworks for database management (CloudSQL) with Workload Identity authentication",
        "• Mentor and lead junior engineers in DevOps best practices, cloud migration strategies, and infrastructure automation",
        "• Collaborate with cross-functional teams to identify and solve complex infrastructure and deployment challenges",
        "• Rapid prototyping of proof-of-concept solutions for cloud migration and modernization initiatives"
      ]
    },
    {
      "id": 3,
      "position": "Senior DevSecOps Engineer",
      "employer": "BICBank Cambodia",
      "date": "Jan 2023 - Jul 2024 · 1 yr 2 mos",
      "type": "Freelance",
      "description": [
        "Led comprehensive cloud migration and infrastructure automation for enterprise banking systems using AWS and Infrastructure as Code.",
        "Technical Implementation:",
        "• Designed and implemented secure CI/CD pipelines with GitLab for 5000+ users, integrating automated security scanning (SAST/DAST)",
        "• Architected AWS infrastructure using Terraform and CloudFormation for multi-account landing zone deployment",
        "• Implemented container orchestration with AWS EKS, including Istio service mesh and microservices architecture",
        "• Built Infrastructure as Code frameworks for automated provisioning of AWS services (RDS, DynamoDB, Lambda)",
        "• Established comprehensive monitoring and compliance framework ensuring PCI-DSS and regulatory requirements",
        "• Implemented GitOps methodology with ArgoCD for declarative infrastructure and application deployment",
        "• Led technical team in rapid prototyping and proof-of-concept development for cloud-native solutions",
        "• Automated security compliance with policy enforcement using Open Policy Agent GateKeeper"
      ]
    },
    {
      "id": 4,
      "position": "Senior DevOps Engineer",
      "employer": "BB Digital",
      "date": "Feb 2023 - May 2024 · 1 yr 4 mos",
      "type": "Freelance",
      "description": [
        "Designed and implemented comprehensive DevSecOps infrastructure automation and secure CI/CD pipelines.",
        "Key Achievements:",
        "• Implemented DevSecOps best practices with automated security scanning integrated into CI/CD pipelines using GitLab CI/ArgoCD",
        "• Built Infrastructure as Code (IaC) frameworks using Terraform for consistent, reproducible infrastructure deployment",
        "• Designed container orchestration solutions with Kubernetes, implementing KEDA and Karpenter for auto-scaling",
        "• Established comprehensive monitoring and observability stack (Promtail, Loki, Grafana, Prometheus, Jaeger)",
        "• Automated security compliance with HashiCorp Vault, OPA GateKeeper, and integrated SAST/DAST scanning tools",
        "• Implemented AWS WAF automation for web application security and threat protection"
      ]
    },
    {
      "id": 5,
      "parent": 1,
      "position": "Senior DevSecOps Engineer",
      "employer": "Onqlave",
      "date": "Jun 2023 - Sep 2023 · 4 mos",
      "type": "Work",
      "description": [
        "As a DevSecOps engineer at OQL Company in Australia, I am responsible for ensuring the security and reliability of the company's Encryption as a Service platform on Google Cloud Platform. I work in a fully secured environment and use a landing zone approach with Google Cloud Foundation Fabric.",
        "My responsibilities include:",
        "• Implementing and managing DevSecOps best practices throughout the software development lifecycle, from code development to deployment and operations.",
        "• Using Google Cloud Platform security tools and services to protect the company's infrastructure, data, and applications.",
        "• Configuring and managing Google Cloud Foundation Fabric to create a secure landing zone for the Encryption as a Service platform.",
        "• Working with other engineers to automate security tasks and integrate security into the company's development and operations processes.",
        "• Monitoring the performance and security of the Encryption as a Service platform and responding to incidents promptly.",
        "I am a highly skilled and experienced DevSecOps engineer with a deep understanding of Google Cloud Platform security tools and services. I am also passionate about DevSecOps and am committed to delivering secure and reliable software."
      ]
    },
    {
      "id": 6,
      "parent": 1,
      "position": "Senior DevSecOps Engineer",
      "employer": "Dentity",
      "date": "Dec 2022 - Sep 2023 · 10 mos",
      "type": "Work",
      "description": [
        "Designed and implemented secure CI/CD pipelines and cloud-native infrastructure for identity service platform.",
        "Infrastructure Automation:",
        "• Built automated deployment pipelines to AWS EKS using GitLab CI and ArgoCD with GitOps methodology",
        "• Implemented Infrastructure as Code using Terraform for consistent and reproducible AWS infrastructure provisioning",
        "• Designed container orchestration with Kubernetes, implementing auto-scaling using KEDA and Karpenter",
        "• Established DevSecOps best practices with integrated security scanning (Snyk, SonarQube, Trivy, OWASP ZAP)",
        "• Implemented comprehensive monitoring and observability using Prometheus, Grafana, Loki, and AWS X-Ray",
        "• Automated secret management and rotation using HashiCorp Vault with policy enforcement via OPA GateKeeper",
        "• Configured AWS WAF automation for application security and threat protection"
      ]
    },
    {
      "id": 7,
      "parent": 1,
      "position": "DevOps Engineer",
      "employer": "GEM - Global Enterprise Mobility",
      "date": "Sep 2022 - Dec 2022 · 4 mos",
      "type": "Work",
      "description": [
        "Designed and implemented comprehensive logging, tracing, and monitoring infrastructure automation on AWS.",
        "Infrastructure & Automation:",
        "• Built AWS infrastructure automation using CloudFormation for scalable logging and observability systems",
        "• Implemented container-based log collection and processing pipeline using Fluent Bit and Loki",
        "• Designed distributed tracing architecture with OpenTelemetry and AWS X-Ray for application performance monitoring",
        "• Created Infrastructure as Code using HashiCorp Packer for automated AMI creation and configuration management",
        "• Established monitoring and visualization platform using Grafana for real-time infrastructure and application insights",
        "• Automated infrastructure provisioning and management for high-availability, scalable logging system"
      ]
    },
    {
      "id": 8,
      "company": true,
      "position": "DevOps Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "May 2021 - Jul 2022 · 1 yr 3 mos",
      "type": "Work",
      "description": [
        "Saltlux is a leading AI and big data company in South Korea, providing innovative solutions and services to various industries.",
        "Awarded Employee of the Year for outstanding performance and contributions to the company."
      ],
      "children": [9, 10, 11, 12]
    },
    {
      "id": 9,
      "position": "DevOps Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "Aug 2021 - Jul 2022 · 1 yr",
      "type": "Work",
      "description": [
        "Led DevOps infrastructure and container orchestration for large-scale data processing systems.",
        "Container & Infrastructure Management:",
        "• Managed Google Kubernetes Engine (GKE) cluster with 800+ nodes for high-throughput container orchestration",
        "• Implemented microservices architecture with Docker containerization for scalable data processing applications",
        "• Built real-time data streaming infrastructure using Apache Kafka for processing large volumes of data",
        "• Designed in-memory caching layer using Redis for high-performance data access and retrieval",
        "• Established comprehensive monitoring and observability using Loki, Promtail, and Grafana for infrastructure and application health",
        "• Implemented automated scaling and resource optimization for cloud-native containerized workloads",
        "• Applied DevOps best practices for security, automation, and optimization of cloud infrastructure"
      ]
    },
    {
      "id": 10,
      "position": "C# Software Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "Oct 2021 - Jul 2022 · 10 mos",
      "type": "Work",
      "description": [
        "Personal Agent Desktop: Part of the Personal Agent project, personalized data mining, using resources from the user's own computer. Personal Agent desktop is in the presentation layer to manage the collected data, statistics and all source to collect of user. (hybrid app with Personal Agent web with more personal functions)",
        "Personal Agent windows services: Part of the Personal Agent project, personalized data mining, using resources from the user's own computer. The windows service will be responsible for checking the collection schedule and conducting highly personalized data collection."
      ]
    },
    {
      "id": 11,
      "position": "Javascript Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "Aug 2021 - Jul 2022 · 1 yr",
      "type": "Work",
      "description": [
        "Account control extension: Chromium-core extension for obtaining account-based cookies for the collection of data that requires login authentication such as social networks. Collect facebook full access token of account.",
        "Personal Agent web-frontend: Part of the Personal Agent project, personalized data mining, using resources from the user's own computer. Personal Agent web-frontend is in the application layer to manage the collected data, statistics and all source to collect of user.",
        "Blocking paywall extension: Chromium-core extension for blocking the payment required in some Newspaper (for data collection module)"
      ]
    },
    {
      "id": 12,
      "position": "Java Software Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "Jun 2021 - Jul 2022 · 1 yr 2 mos",
      "type": "Work",
      "description": [
        "Software development experience with backend microservices architecture and containerized applications.",
        "Backend Development & Architecture:",
        "• Designed and developed scalable data extraction and processing microservices with containerized deployment",
        "• Built real-time search and processing systems with automated scaling capabilities and intelligent caching",
        "• Implemented microservices architecture with MongoDB for unstructured data and PostgreSQL for structured analytics",
        "• Developed automated worker management systems with queue processing and proxy rotation for high-availability",
        "• Created web application backends with RESTful APIs and database integration for data management platforms",
        "• Applied software engineering best practices including code versioning, testing, and continuous integration"
      ]
    },
    {
      "id": 13,
      "position": "Python Engineer",
      "employer": "Saltlux (솔트룩스)",
      "date": "May 2021 - Jul 2022 · 1 yr 3 mos",
      "type": "Work",
      "description": [
        "Internal Software:",
        "• Social Accounts Manager (windows application):",
        "• Get cookies and api tokens on a large number of accounts automatically.",
        "• Auto create accounts and get account info to crawl data (social network).",
        "• Automate all work if possible in the business."
      ]
    },
    {
      "id": 14,
      "company": true,
      "position": "METI Government of JAPAN, Internship Program (経済産業省　国際化促進インターンシップ事業)",
      "employer": "GRAVITY Corporation (グラビティ株式会社)",
      "date": "Dec 2020 - Feb 2021 · 3 mos",
      "type": "Work",
      "description": [
        "This internship was approved by the METI Japan Internship program, organized by METI Government of Japan",
        "• Acquired knowledge about Blockchain, Web 3.0, Smart contract through internal training conferences",
        "• Learned deeply about Scrum and Agile software development methods.",
        "• Worked under the supervision of CTO",
        "• Contributed to the company's first product in the education sector"
      ]
    },
    {
      "id": 15,
      "company": true,
      "position": "PHP Web Developer",
      "employer": "WeSports",
      "date": "Apr 2019 - Jun 2020 · 1 yr 3 mos",
      "type": "Work",
      "description": [
        "•  Worked with Wordpress to create and maintain dynamic websites and web applications",
        "•  Deployed Wordpress on Apache servers and used jQuery for front-end interactivity",
        "•  Developed software solutions using PHP frameworks, SQL databases, and object-oriented programming",
        "•  Used Git for version control and collaboration"
      ]
    }
  ],
  "skills": [{
      "category": "cloud-platforms",
      "name": "Cloud Platforms",
      "items": ["AWS", "Azure", "GCP"],
      "extraclass": "li25"
    },
    {
      "category": "iac-tools",
      "name": "Infrastructure as Code",
      "items": ["Terraform", "CloudFormation", "Ansible", "Terragrunt", "OpenTofu"],
      "extraclass": "li50"
    },
    {
      "category": "programming",
      "name": "Programming Languages",
      "items": ["Python", "Bash", "Golang", "Java", "NodeJS", "C#"],
      "extraclass": "li25"
    },
    {
      "category": "container-tools",
      "name": "Containerization & Orchestration",
      "items": ["Docker", "Kubernetes", "Helm", "KEDA", "Karpenter", "Istio", "EKS", "GKE"],
      "extraclass": "li33"
    },
    {
      "category": "cicd-tools",
      "name": "CI/CD & GitOps",
      "items": ["GitLab CI", "ArgoCD", "Jenkins", "GitHub Actions", "GitOps", "Azure Pipeline"],
      "extraclass": "li33"
    },
    {
      "category": "devsecops",
      "name": "DevSecOps & Security",
      "items": ["HashiCorp Vault", "OPA GateKeeper", "Snyk", "SonarQube", "Trivy", "OWASP ZAP", "SAST/DAST"],
      "extraclass": "li33"
    },
    {
      "category": "monitoring",
      "name": "Monitoring & Observability",
      "items": ["Prometheus", "Grafana", "Loki", "Jaeger", "CloudWatch", "X-Ray", "ELK Stack"],
      "extraclass": "li50"
    },
    {
      "category": "database",
      "name": "Databases & Storage",
      "items": ["PostgreSQL", "MongoDB", "Redis", "MySQL", "DynamoDB", "RDS", "Kafka"],
      "extraclass": "li50"
    }
  ],
  "certifications": {
    "title": "Certifications",
    "description": "Click to see more certifications",
    "link": "https://www.linkedin.com/in/congson99/details/certifications/",
    "items": [{
        "name": "IBM DevOps and Software Engineering Specialization",
        "image": "common/img/IBM-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/specialization/certificate/GZLCQK9NM36N"
      },
      {
        "name": "DevOps on AWS Specialization",
        "image": "common/img/Udemy-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/specialization/certificate/ZDRLWB4QQ7XH"
      },
      {
        "name": "Core Infrastructure",
        "image": "common/img/Google-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/certificate/VEBM4EY9H969"
      },
      {
        "name": "Continuous Integration and Continuous Delivery (CI/CD)",
        "image": "common/img/IBM-icon.jpg",
        "link": "https://www.coursera.org/account/accomplishments/certificate/R7WJJKU5U4GD"
      },
      {
        "name": "Python for Data Science and AI",
        "image": "common/img/IBM-icon.jpg",
        "link": "https://www.credly.com/badges/59286e28-5fd4-40d4-877a-797385dc4014/linked_in_profile"
      },
      {
        "name": "Python For Data Analysis, Data Science & ML With Pandas",
        "image": "common/img/Udemy-icon.jpg",
        "link": "https://ude.my/UC-6dbad681-7f62-4160-b2f0-b3890cf63984/"
      },
      {
        "name": "APTIS - C level (CERF)",
        "image": "common/img/BC-icon.jpg",
        "link": "#"
      }
    ]
  },
  "education": [{
      "degree": "International Business Economics",
      "school": "Foreign trade university",
      "date": "Aug 2017 - Mar 2021"
    }
  ]
}